OpenNuvoton/M2354BSP/SampleCode/StdDriver/USBD_VCOM_MultiPort/main.c
    u32IntStatus = UART2->INTSTS;

    if((u32IntStatus & UART_INTSTS_RDAIF_Msk) || (u32IntStatus & UART_INTSTS_RXTOIF_Msk))
    {
        /* Receiver FIFO threshold level is reached or Rx time out */

        /* Get all the input characters */
        while(!(UART2->FIFOSTS & UART_FIFOSTS_RXEMPTY_Msk))
        {
            /* Get the character from UART Buffer */
            u8InChar = (uint8_t)UART2->DAT;

            /* Check if buffer full */
            if(g_u16ComRbytes2 < RXBUFSIZE)
            {
                /* Enqueue the character */
                s_au8ComRbuf2[g_u16ComRtail2++] = u8InChar;
                if(g_u16ComRtail2 >= RXBUFSIZE)
                {
                    g_u16ComRtail2 = 0;
                }
                g_u16ComRbytes2++;
            }
            else
            {
                /* FIFO over run */
            }
        }
    }

    if(u32IntStatus & UART_INTSTS_THREIF_Msk)
    {

        if(g_u16ComTbytes2 && (UART2->INTEN & UART_INTEN_THREIEN_Msk))
        {
            /* Fill the Tx FIFO */
            i32Size = g_u16ComTbytes2;
            if(i32Size >= UART2_FIFO_SIZE)
            {
                i32Size = UART2_FIFO_SIZE;
            }

            while(i32Size)
            {
                u8InChar = s_au8ComTbuf2[g_u16ComThead2++];
                UART2->DAT = u8InChar;
                if(g_u16ComThead2 >= TXBUFSIZE)
                {
                    g_u16ComThead2 = 0;
                }
                g_u16ComTbytes2--;
                i32Size--;
            }
        }
        else
        {
            /* No more data, just stop Tx (Stop work) */
            UART2->INTEN &= ~UART_INTEN_THREIEN_Msk;
        }
    }
}
#endif

void VCOM_TransferData(void)
{
    uint32_t i, u32Len;

    /* Check whether USB is ready for next packet or not */
#if (VCOM_CNT >= 1)
    if(g_u32TxSize0 == 0)
    {
        /* Check whether we have new COM Rx data to send to USB or not */
        if(g_u16ComRbytes0)
        {
            u32Len = g_u16ComRbytes0;
            if(u32Len > EP2_MAX_PKT_SIZE)
            {
                u32Len = EP2_MAX_PKT_SIZE;
            }

            for(i = 0; i < u32Len; i++)
            {
                s_au8RxBuf0[i] = s_au8ComRbuf0[g_u16ComRhead0++];
                if(g_u16ComRhead0 >= RXBUFSIZE)
                {
                    g_u16ComRhead0 = 0;
                }
            }

            __set_PRIMASK(1);
            g_u16ComRbytes0 -= u32Len;
            __set_PRIMASK(0);

            g_u32TxSize0 = u32Len;
            USBD_MemCopy((uint8_t *)(USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP2)), (uint8_t *)s_au8RxBuf0, u32Len);
            USBD_SET_PAYLOAD_LEN(EP2, u32Len);
        }
        else
        {
            /* Prepare a zero packet if previous packet size is EP2_MAX_PKT_SIZE and
               no more data to send at this moment to note Host the transfer has been done */
            u32Len = USBD_GET_PAYLOAD_LEN(EP2);
            if(u32Len == EP2_MAX_PKT_SIZE)
                USBD_SET_PAYLOAD_LEN(EP2, 0);
        }
    }
#endif

#if (VCOM_CNT >= 2)
    if(g_u32TxSize1 == 0)
    {
        /* Check whether we have new COM Rx data to send to USB or not */
        if(g_u16ComRbytes1)
        {
            u32Len = g_u16ComRbytes1;
            if(u32Len > EP7_MAX_PKT_SIZE)
            {
                u32Len = EP7_MAX_PKT_SIZE;
            }

            for(i = 0; i < u32Len; i++)
            {
                s_au8RxBuf1[i] = s_au8ComRbuf1[g_u16ComRhead1++];
                if(g_u16ComRhead1 >= RXBUFSIZE)
                {
                    g_u16ComRhead1 = 0;
                }
            }

            __set_PRIMASK(1);
            g_u16ComRbytes1 -= u32Len;
            __set_PRIMASK(0);

            g_u32TxSize1 = u32Len;
            USBD_MemCopy((uint8_t *)(USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP7)), (uint8_t *)s_au8RxBuf1, u32Len);
            USBD_SET_PAYLOAD_LEN(EP7, u32Len);
        }
        else
        {
            /* Prepare a zero packet if previous packet size is EP7_MAX_PKT_SIZE and
               no more data to send at this moment to note Host the transfer has been done */
            u32Len = USBD_GET_PAYLOAD_LEN(EP7);
            if(u32Len == EP7_MAX_PKT_SIZE)
                USBD_SET_PAYLOAD_LEN(EP7, 0);
        }
    }
#endif

#if (VCOM_CNT >= 3)
    if(g_u32TxSize2 == 0)
    {
        /* Check whether we have new COM Rx data to send to USB or not */
        if(g_u16ComRbytes2)
        {
            u32Len = g_u16ComRbytes2;
            if(u32Len > EP10_MAX_PKT_SIZE)
            {
                u32Len = EP10_MAX_PKT_SIZE;
            }

            for(i = 0; i < u32Len; i++)
            {
                s_au8RxBuf2[i] = s_au8ComRbuf2[g_u16ComRhead2++];
                if(g_u16ComRhead2 >= RXBUFSIZE)
                {
                    g_u16ComRhead2 = 0;
                }
            }

            __set_PRIMASK(1);
            g_u16ComRbytes2 -= u32Len;
            __set_PRIMASK(0);

            g_u32TxSize2 = u32Len;
            USBD_MemCopy((uint8_t *)(USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP10)), (uint8_t *)s_au8RxBuf2, u32Len);
            USBD_SET_PAYLOAD_LEN(EP10, u32Len);
        }
        else
        {
            /* Prepare a zero packet if previous packet size is EP7_MAX_PKT_SIZE and
               no more data to send at this moment to note Host the transfer has been done */
            u32Len = USBD_GET_PAYLOAD_LEN(EP10);
            if(u32Len == EP10_MAX_PKT_SIZE)
                USBD_SET_PAYLOAD_LEN(EP10, 0);
        }
    }
#endif

#if (VCOM_CNT >= 1)
    /* Process the Bulk out data when bulk out data is ready. */
    if(g_i8BulkOutReady0 && (g_u32RxSize0 <= TXBUFSIZE - g_u16ComTbytes0))
    {
        for(i = 0; i < g_u32RxSize0; i++)
        {
            s_au8ComTbuf0[g_u16ComTtail0++] = g_pu8RxBuf0[i];
            if(g_u16ComTtail0 >= TXBUFSIZE)
            {
                g_u16ComTtail0 = 0;
            }
        }

        __set_PRIMASK(1);
        g_u16ComTbytes0 += g_u32RxSize0;
        __set_PRIMASK(0);

        g_u32RxSize0 = 0;
        g_i8BulkOutReady0 = 0; /* Clear bulk out ready flag */

        /* Ready to get next BULK out */
        USBD_SET_PAYLOAD_LEN(EP3, EP3_MAX_PKT_SIZE);
    }
#endif

#if (VCOM_CNT >= 2)
    if(g_i8BulkOutReady1 && (g_u32RxSize1 <= TXBUFSIZE - g_u16ComTbytes1))
    {
        for(i = 0; i < g_u32RxSize1; i++)
        {
            s_au8ComTbuf1[g_u16ComTtail1++] = g_pu8RxBuf1[i];
            if(g_u16ComTtail1 >= TXBUFSIZE)
            {
                g_u16ComTtail1 = 0;
            }
        }

        __set_PRIMASK(1);
        g_u16ComTbytes1 += g_u32RxSize1;
        __set_PRIMASK(0);

        g_u32RxSize1 = 0;
        g_i8BulkOutReady1 = 0; /* Clear bulk out ready flag */

        /* Ready to get next BULK out */
        USBD_SET_PAYLOAD_LEN(EP6, EP6_MAX_PKT_SIZE);
    }
#endif

#if (VCOM_CNT >= 3)
    if(g_i8BulkOutReady2 && (g_u32RxSize2 <= TXBUFSIZE - g_u16ComTbytes2))
    {
        for(i = 0; i < g_u32RxSize2; i++)
        {
            s_au8ComTbuf2[g_u16ComTtail2++] = g_pu8RxBuf2[i];
            if(g_u16ComTtail2 >= TXBUFSIZE)
            {
                g_u16ComTtail2 = 0;
            }
        }

        __set_PRIMASK(1);
        g_u16ComTbytes2 += g_u32RxSize2;
        __set_PRIMASK(0);

